[
  {
    "date": "2025-10-25T21:23:20.806090+00:00",
    "topic": "And3s",
    "description": "Led the development of an online credit platform that assesses borrowers through their digital footprint. The initial MVP garnered over 3000 registrations within the first 90 days. Recognizing its innovation, the concept secured an invitation to participate in a prominent technology start-up program and incubator in South Florida, situated within FAU Research Park."
  },
  {
    "date": "2025-10-25T22:03:12.941597+00:00",
    "topic": "SGR",
    "description": "Conducted a successful market analysis and designed a Go-to-Market strategy to launch DaaS and SaaS solutions in the Spanish market."
  },
  {
    "date": "2025-10-25T22:04:36.284292+00:00",
    "topic": "Lexios",
    "description": "lexios.io"
  },
  {
    "date": "2025-10-25T22:09:08.297644+00:00",
    "topic": "Lexios",
    "description": "As growth leader, I effectively employed growth hacking techniques to organically expand our extension user base. This led to exponential growth in social media channels, serving as the primary funnel to our registration page. Recognizing its innovation, our concept secured an invitation to participate in a prominent Digital Innovation Hub in Switzerland, situated within EPFL Innovation Park."
  },
  {
    "date": "2025-10-26T12:09:19.426210+00:00",
    "topic": "Prime Equity",
    "description": "Led a transformative and rigorous internship program, managing the project end-to-end. Collaborating with major local universities and other company departments, recruited and trained senior Finance undergraduates, resulting in 15 in-house trained and licensed loan officers within a year. This strategic initiative significantly elevated sales and continues to impact the company, with over 40% of the current staff emerging from this successful program..As the project leader for a digital transformation initiative, I collaborated with various company departments to diversify lead acquisition channels. Through a strong social media presence and targeted digital marketing, we successfully pre-qualified prospects via a collaborative call center effort. This seamless process directed live-qualified leads to our loan officers, breaking new ground beyond traditional channels and fostering cross-departmental growth."
  },
  {
    "date": "2025-10-26T19:21:31.247876+00:00",
    "topic": "Swissxer",
    "description": "Directed the global physical trade flow of diverse commodities, including grains, oilseeds, metals, minerals, and energy products, overseeing the entire process. Identified and capitalized on arbitrage opportunities while effectively managing critical buyer-supplier relationships.Led international, cross-functional teams, ensuring compliance in handling and shipment activities."
  },
  {
    "date": "2025-10-26T19:22:20.991098+00:00",
    "topic": "Swissxer",
    "description": "Successfully negotiated high-value contracts, mitigated credit and performance risks, and supervised traffic teams for seamless goods movement."
  }
]